Repository: jerojasro/grok-tiddlywiki-es
Catalog: po/*/Installing_TiddlyWiki.json.po
Languages: es

source: TiddlyWiki, while having many virtues, is tricky to get started with. That's partly because it can do pretty much anything, so it's not always obvious what to do with it once you have it. Working through this book should take care of that part.
es: Aunque TiddlyWiki tiene muchas virtudes, empezar a usarlo es complicado. Hasta cierto punto, es así porque usted puede hacer muchas cosas con él, así que no siempre es obvio qué hacer con él una vez lo echa a andar. Leer este libro debería encargarse de ese problema.

source: Another problem is that there is a ridiculous array of options for what software to use with TiddlyWiki. I know, right: it's already a piece of software that runs in a browser, so why do you have to choose other software? Basically, because TiddlyWiki isn't a centralized service, there are many different places you can store your data. You can keep it on your local computer, make it accessible from a server you own, keep it on Dropbox, keep it in a GitHub repository, keep it on your phone, engrave it on a special spy pocketknife with a Bluetooth-enabled laser cutter\u2026and each of these methods has its own associated plugin or browser extension or third-party web service account or downloaded tool. These tools are often called //savers//.
es: Otro problema con TiddlyWiki es que hay una variedad enorme de software para usarlo. Usted se estará preguntando: si es una aplicación que corre en el navegador, ¿por qué tengo que decidir con cuál software utilizarlo? Básicamente, como TiddlyWiki no es un servicio centralizado, es posible escoger muchas alternativas para guardar sus datos. Puede ponerlos en su computador personal, hacerlos accesibles desde Internet en un servidor controlado por usted, tenerlos en Dropbox, en un repositorio en GitHub, en su teléfono inteligente, grabarlos en su navaja espía especial con láser controlado por Bluetooth \u2026y cada una una de estas alternativas tiene su propio plugin o extensión para el navegador o cuenta en servicio web o herramienta instalable localmente. En general, estas herramientas se conocen como //mecanismos de guardado//.

source: I know your eyes are glazing over and you're questioning your choices in life, so let's forget about savers for the moment. We're both going to go download and install [[TiddlyDesktop|https://github.com/Jermolene/TiddlyDesktop/releases]], which is an all-in-one turnkey solution that just works and has no extra options or configuration settings to deal with. TiddlyDesktop is by no means the best option for everyone, so once you've gotten comfortable with TiddlyWiki, you can [[look into the other options|Options for Saving and Hosting Your Wiki]] for saving -- especially if you want to use your wiki from multiple computers.
es: Sé que usted seguramente se está aburriendo y considerando mejores usos de su tiempo en este momento, así que dejaremos de discutir mecanismos de guardado. Vamos a descargar e instalar [[TiddlyDesktop|https://github.com/Jermolene/TiddlyDesktop/releases]], que es una solución llave-en-mano que funciona adecuadamente sin requerir configuración adicional. TiddlyDesktop no es la mejor opción para todas las situaciones, así que una vez usted se haya habituado a TiddlyWiki, puede [[revisar las otras opciones disponibles|Options for Saving and Hosting Your Wiki]] para guardar sus datos -- especialmente si desea acceder a su wiki desde distintos dispositivos.

source: (//Note:// If you have some experience with TiddlyWiki already and have another saver that you prefer, you want to do all your work with GTW on a mobile device, or you don't think TiddlyDesktop will work for you for whatever reason, feel free to use [[a different saver|Options for Saving and Hosting Your Wiki]] instead. The rest of this book will only occasionally talk about TiddlyDesktop, and the saver you are using is rarely relevant at all as long as it's successfully saving your changes.)
es: (//Nota:// Si ya cuenta con experiencia usando TiddlyWiki y conoce y prefiere otro mecanismo de guardado, o quiere hacer los ejercicios de este libro en un dispositivo móvil, o considera que TiddlyDesktop no es la mejor alternativa para usted por el motivo que sea, siéntase en libertad de usar [[otro mecanismo de guardado|Options for Saving and Hosting Your Wiki]] en su lugar. TiddlyDesktop sólo será mencionado ocasionalmente en el resto de este libro, y el mecanismo de guardado rara vez es relevante, desde que guarde los cambios que usted haga exitosamente.)

source: !! Installation process
es: !! Proceso de instalación

source: To install TiddlyDesktop, hit the link above, expand the \u201cAssets\u201d section of the most recent release, and download the appropriate file for your operating system (if you have a reasonably new computer, it'll be `win64`, `mac64`, or `linux64`, depending on whether you use Windows, MacOS, or Linux).
es: Para instalar TiddlyDesktop, abra el enlace anterior, navegue a la sección \u201cAssets\u201d (Objetos) de la versión más reciente, y descargue el archivo apropiado para su sistema operativo (si su computador es relativamente reciente, querrá `win64`, `mac64` o `linux64`, dependiendo de si usa Windows, MacOS, o Linux).

source: If you're not sure how to proceed from there:
es: Si no está seguro de cómo continuar luego de hacer esto:

source: Watch the [[official introductory video starting from the Windows section|https://youtu.be/i3Bggkm7paA?t=163]].
es: Mire el [[video introductorio oficial, desde la sección acerca de Windows|https://youtu.be/i3Bggkm7paA?t=163]].

source: Watch the [[official introductory video|https://www.youtube.com/watch?v=i3Bggkm7paA]] through the end of the section describing macOS (Windows steps are shown afterwards).
es: Mire el [[video introductorio oficial|https://www.youtube.com/watch?v=i3Bggkm7paA]] hasta completar la sección que habla de macOS (los pasos para Windows se muestran luego de eso).

source: Unzip the file, go into the `tiddlydesktop-someversion` folder it contains, and run the `nw` executable.
es: Descomprima el archivo, entre al directorio `tiddlydesktop-algunaversion` que está allí, y corra el ejecutable `nw`.

source: The exact steps needed to accomplish this may differ slightly depending on your system and what version you've downloaded, but it will probably look something like this at a command line:
es: Los pasos específicos requeridos para lograr esto pueden diferir ligeramente dependiendo de su sistema y de qué versión descargó, pero seguramente serán similares a los siguientes, en una línea de órdenes:

source: Once we have TiddlyDesktop installed, there's one more step: we need to create a new, blank wiki file to put in it. TiddlyDesktop can automatically download the latest version from the web and save it for us: click the //Create new wiki// button on the toolbar, pick \u201cEmpty TiddlyWiki file,\u201d and choose a location and filename. It's important that you end the filename with `.html`, or funny things will happen when you try to open it (this is a known bug). After you save the new wiki, TiddlyDesktop should open it automatically in a new window. If it doesn't, or next time you start TiddlyDesktop, click the //open// button in its entry in the list of wikis to start it up.
es: Una vez TiddlyDesktop esté instalado, queda una cosa por hacer: necesitamos crear un wiki nuevo y el archivo en el que quedará guardado. TiddlyDesktop puede descargar automáticamente la versión más reciente desde la web y guardarla por nosotros: haga clic en el botón //Create new wiki// (crear nuevo wiki) en la barra de herramientas, escoja \u201cEmpty TiddlyWiki file,\u201d (archivo TiddlyWiki vacío), y escoja una ubicación y nombre de archivo. Es importante que el nombre de archivo termine con el texto `.html` o podría encontrarse con problemas cuando trate de abrirlo (es un fallo ya reportado). Luego de que guarde su wiki, TiddlyDesktop debería abrirlo automáticamente en una nueva ventana. Si no lo hace, o la próxima vez que abra TiddlyDesktop, presione el botón //open// (abrir) en la entrada correspondiente en la lista de wikis.

source: !! Backups
es: !! Copias de seguridad

source: Before we proceed, just one more thing. You probably won't care much if you lose your sample wiki. But if you're keeping real thoughts and ideas and notes in TiddlyWiki, ''you //must// back up your wiki regularly''. This is not an optional good practice or something you can do later \u201cwhen you get around to it.\u201d If you accidentally delete a bunch of content in TiddlyWiki, your hard drive crashes, or your computer gets confused and saves your wiki incorrectly, and you don't have a backup, everything will be gone forever. That might not seem like that big a deal right now, but once you've been using TiddlyWiki for a while, losing your wiki is the digital equivalent of having your house burn to the ground. If you don't have a regular backup strategy for your computer, you can check out my [[blog post|https://controlaltbackspace.org/filesystem/starting-off-with-a-backup/]] about that. Compared to losing data, it is easy, fast, and cheap!
es: Una cosa más, antes de que continuemos. En este punto probablemente no es grave si usted pierde su wiki de ejemplo. Pero una vez empiece a guardar sus ideas y notas y planes en TiddlyWiki, ''usted debe hacer copias de seguridad con frecuencia''. No es un buen hábito opcional o algo que pueda hacer luego «cuando tenga tiempo.» Si usted accidentalmente borra contenido de TiddlyWiki, su disco duro deja de funcionar, o su computador comete un error y corrompe su wiki, y usted no tiene una copia de seguridad, todos sus datos se habrán perdido permanentemente. Eso no suena preocupante ahora, pero una vez pase suficiente tiempo usando TiddlyWiki, perder su wiki será la versión digital de que su residencia se incendie. Si usted no tiene una estrategia de copias de seguridad periódicas, le invito a revisar mi [[entrada de blog|https://controlaltbackspace.org/filesystem/starting-off-with-a-backup/]] al respecto.

source: If you want to get started learning TiddlyWiki before developing a backup strategy, that's fair enough -- but if you don't already have everything on your hard drive backed up on a regular schedule, go put it on your to-do list or your calendar right now to come up with a backup strategy. Then you can come back and continue with the book.
es: Si desea empezar con TiddlyWiki antes de tener una estrategia para sus copias de seguridad, está bien -- pero si aún no hace copias de su información de manera periódica, póngalo en su lista de tareas por hacer o su agenda ponga ahora mismo. Luego de eso puede volver y continuar con el libro.

source: When you have the `GettingStarted` page of your new TiddlyWiki looking back at you, proceed to the next section.\n
es: Una vez pueda ver la página `GettingStarted` (Primeros Pasos) de su nuevo TiddlyWiki, proceda a la siguiente sección.

source: Installing TiddlyWiki
es: Instalar TiddlyWiki
